Revit 2023 API
STLExportOptions Constructor (STLExportResolution)
 Constructs a new instance of STLExportOptions with all predefined tessellation settings, depending on STL export resolution type. Note: in case of Custom resolution type, tessellation settings won't be predefined and will have default values.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2021.1
Syntax
C#
[ObsoleteAttribute("This constructor is deprecated in Revit 2023 and may be removed in a later version of Revit. We suggest you use another constructor with ExportResolution type of the input parameter instead.")]
public STLExportOptions(
	STLExportResolution resolutionType
)
Visual Basic
<ObsoleteAttribute("This constructor is deprecated in Revit 2023 and may be removed in a later version of Revit. We suggest you use another constructor with ExportResolution type of the input parameter instead.")> _
Public Sub New ( _
	resolutionType As STLExportResolution _
)
Visual C++
[ObsoleteAttribute(L"This constructor is deprecated in Revit 2023 and may be removed in a later version of Revit. We suggest you use another constructor with ExportResolution type of the input parameter instead.")]
public:
STLExportOptions(
	STLExportResolution resolutionType
)
Parameters
resolutionType
Type: Autodesk.Revit.DB.STLExportResolution
 The type of STL export resolution.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
STLExportOptions Class
STLExportOptions Overload
Autodesk.Revit.DB Namespace